Tekla Open API Reference for Tekla Structures 2025
RebarLeg Class
 This represents a leg of a rebar and is used in the RebarComplexGeometry class.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarLeg
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RebarLeg
<SerializableAttribute>
Public NotInheritable Class RebarLeg
The RebarLeg type exposes the following members.
Properties
Name | Description
Curve
 Gets the curve of the leg
Origin
 Gets the origin of the leg
Top
See Also
Reference
Tekla.Structures.Model Namespace